# АНАЛИЗ ДАННЫХ И ИСКУССТВЕННЫЙ ИНТЕЛЛЕКТ [in GameDev]
Отчет по лабораторной работе #1 выполнил(а):

Максимцов Николай Владимирович
РИ-300016 Отметка о выполнении заданий (заполняется студентом):
Задание	Выполнение	Баллы
Задание 1	#	60
Задание 2	#	20
Задание 3	#	20
знак "*" - задание выполнено; знак "#" - задание не выполнено;

Работу проверили:

к.т.н., доцент Денисов Д.В.
к.э.н., доцент Панов М.А.
ст. преп., Фадеев В.О.
N|Solid

Build Status

Структура отчета

Данные о работе: название работы, фио, группа, выполненные задания.
Цель работы.
Задание 1.
Код реализации выполнения задания. Визуализация результатов выполнения (если применимо).
Задание 2.
Код реализации выполнения задания. Визуализация результатов выполнения (если применимо).
Задание 3.
Код реализации выполнения задания. Визуализация результатов выполнения (если применимо).
Выводы.
✨Magic ✨
Цель работы
Основы работы в среде разработки систем виртуальной и дополненной реальности. Основы работы c Unity.

Задание 1
ознакомиться с основными функциями взаимодействием с объектами внутри редактора.
Ход работы:

Для начала я создал проект по шаблону 3D - core
После чего нужно было создать 3 объекта: Plane, Cube и Shpere image
Затем установил компонент Sphere Collider для объекта Sphera ![image](https://user-images.githubusercontent.com/94520383/191991981-f68b59d7-2f30-4e13-a219-c5be8be39b38.pn
И затем настроил его как триггер как показано в скриншоте до этого
После я перекрасил объект куб в красный цвет image
Добавил кубу симуляцию физики, при это куб не должен проваливаться под Plane image
После этого я, написал скрипт, который будет выводить в консоль сообщение о том, что объект Sphere столкнулся с объектом Cube
void Update()
    {

    }

    private void OnTriggerEnter(Collider other)
    {
        Debug.Log("Произошло столкновение с " + other.gameObject.name);
    }

    private void OnTriggerExit(Collider other)
    {
        Debug.Log("Завершенно столкновение с " + other.gameObject.name);
    }
}
Сделал так, что при столкновении Cube должен менять свой цвет на синий, а при завершении столкновения обратно на красный
void Update()
    {

    }

    private void OnTriggerEnter(Collider other)
    {
        Debug.Log("Произошло столкновение с " + other.gameObject.name);
        other.GetComponent<Renderer>().material.SetColor("_Color", Color.blue);
    }

    private void OnTriggerExit(Collider other)
    {
        Debug.Log("Завершенно столкновение с " + other.gameObject.name);
        other.GetComponent<Renderer>().material.SetColor("_Color", Color.red);
    }
}
Определите связанные функции. Функция модели: определяет модель линейной регрессии wx+b. Функция потерь: функция потерь среднеквадратичной ошибки. Функция оптимизации: метод градиентного спуска для нахождения частных производных w и b.
Задание 2
Что произойдёт с координатами объекта, если он перестанет быть дочерним?
Создайте три различных примера работы компонента RigidBody?
Ход работы:

Координаты доч. объекта берут 0 в родительском. Если перетащить объект и сделать его родительским, то его координаты поменяют числовые значения относительно всей сцены, но объект никак положение не изменит.
Для начала я попробовал поиграться с сопротивлением объекта в RigidBody, после чего он падал то быстрее, то медленнее
Добавил объекту принятие сил, для хоть какого-то урпавления
    void Update()
    {
        if (Input.GetKeyDown(KeyCode.Space)}
    {
        this.rigidbody.AddForce(new Vector3(0f,150f,0f));
    }
}
Также смог добавить скорости
    void Update()
    {
        if (Input.GetKeyDown(KeyCode.Space)}
    {
        this.rigidbody.AddForce(new Vector3(0f,150f,0f));
    }
    Debug.Log("SpeedY:" + this.rigidbody.velocity.y);
}
Задание 3
Реализуйте на сцене генерацию n кубиков. Число n вводится пользователем после старта сцены.
Для начала работы я добавил в свой проект input field и кнопку. image
Выводы
В данной лабораторной работе, я научился, реализовывать на сцене генерацию n кубиков и ознакомился с основными функциями взаимодействием с объектами внутри редактора.

Powered by
BigDigital Team: Denisov | Fadeev | Panov
